###################################################################

# Created by write_sdc on Tue Dec 20 23:21:14 2011

###################################################################
set sdc_version 1.8

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_load -pin_load 0 [get_ports {local_node[0].buffer_full_in}]
set_load -pin_load 0 [get_ports {local_node[0].buffer_full_out}]
set_load -pin_load 0 [get_ports {local_node[0].receiving_data}]
set_load -pin_load 0 [get_ports {local_node[0].sending_data}]
set_load -pin_load 0 [get_ports {local_node[0].data_in[15]}]
set_load -pin_load 0 [get_ports {local_node[0].data_in[14]}]
set_load -pin_load 0 [get_ports {local_node[0].data_in[13]}]
set_load -pin_load 0 [get_ports {local_node[0].data_in[12]}]
set_load -pin_load 0 [get_ports {local_node[0].data_in[11]}]
set_load -pin_load 0 [get_ports {local_node[0].data_in[10]}]
set_load -pin_load 0 [get_ports {local_node[0].data_in[9]}]
set_load -pin_load 0 [get_ports {local_node[0].data_in[8]}]
set_load -pin_load 0 [get_ports {local_node[0].data_in[7]}]
set_load -pin_load 0 [get_ports {local_node[0].data_in[6]}]
set_load -pin_load 0 [get_ports {local_node[0].data_in[5]}]
set_load -pin_load 0 [get_ports {local_node[0].data_in[4]}]
set_load -pin_load 0 [get_ports {local_node[0].data_in[3]}]
set_load -pin_load 0 [get_ports {local_node[0].data_in[2]}]
set_load -pin_load 0 [get_ports {local_node[0].data_in[1]}]
set_load -pin_load 0 [get_ports {local_node[0].data_in[0]}]
set_load -pin_load 0 [get_ports {local_node[0].data_out[15]}]
set_load -pin_load 0 [get_ports {local_node[0].data_out[14]}]
set_load -pin_load 0 [get_ports {local_node[0].data_out[13]}]
set_load -pin_load 0 [get_ports {local_node[0].data_out[12]}]
set_load -pin_load 0 [get_ports {local_node[0].data_out[11]}]
set_load -pin_load 0 [get_ports {local_node[0].data_out[10]}]
set_load -pin_load 0 [get_ports {local_node[0].data_out[9]}]
set_load -pin_load 0 [get_ports {local_node[0].data_out[8]}]
set_load -pin_load 0 [get_ports {local_node[0].data_out[7]}]
set_load -pin_load 0 [get_ports {local_node[0].data_out[6]}]
set_load -pin_load 0 [get_ports {local_node[0].data_out[5]}]
set_load -pin_load 0 [get_ports {local_node[0].data_out[4]}]
set_load -pin_load 0 [get_ports {local_node[0].data_out[3]}]
set_load -pin_load 0 [get_ports {local_node[0].data_out[2]}]
set_load -pin_load 0 [get_ports {local_node[0].data_out[1]}]
set_load -pin_load 0 [get_ports {local_node[0].data_out[0]}]
set_load -pin_load 0 [get_ports {local_node[1].buffer_full_in}]
set_load -pin_load 0 [get_ports {local_node[1].buffer_full_out}]
set_load -pin_load 0 [get_ports {local_node[1].receiving_data}]
set_load -pin_load 0 [get_ports {local_node[1].sending_data}]
set_load -pin_load 0 [get_ports {local_node[1].data_in[15]}]
set_load -pin_load 0 [get_ports {local_node[1].data_in[14]}]
set_load -pin_load 0 [get_ports {local_node[1].data_in[13]}]
set_load -pin_load 0 [get_ports {local_node[1].data_in[12]}]
set_load -pin_load 0 [get_ports {local_node[1].data_in[11]}]
set_load -pin_load 0 [get_ports {local_node[1].data_in[10]}]
set_load -pin_load 0 [get_ports {local_node[1].data_in[9]}]
set_load -pin_load 0 [get_ports {local_node[1].data_in[8]}]
set_load -pin_load 0 [get_ports {local_node[1].data_in[7]}]
set_load -pin_load 0 [get_ports {local_node[1].data_in[6]}]
set_load -pin_load 0 [get_ports {local_node[1].data_in[5]}]
set_load -pin_load 0 [get_ports {local_node[1].data_in[4]}]
set_load -pin_load 0 [get_ports {local_node[1].data_in[3]}]
set_load -pin_load 0 [get_ports {local_node[1].data_in[2]}]
set_load -pin_load 0 [get_ports {local_node[1].data_in[1]}]
set_load -pin_load 0 [get_ports {local_node[1].data_in[0]}]
set_load -pin_load 0 [get_ports {local_node[1].data_out[15]}]
set_load -pin_load 0 [get_ports {local_node[1].data_out[14]}]
set_load -pin_load 0 [get_ports {local_node[1].data_out[13]}]
set_load -pin_load 0 [get_ports {local_node[1].data_out[12]}]
set_load -pin_load 0 [get_ports {local_node[1].data_out[11]}]
set_load -pin_load 0 [get_ports {local_node[1].data_out[10]}]
set_load -pin_load 0 [get_ports {local_node[1].data_out[9]}]
set_load -pin_load 0 [get_ports {local_node[1].data_out[8]}]
set_load -pin_load 0 [get_ports {local_node[1].data_out[7]}]
set_load -pin_load 0 [get_ports {local_node[1].data_out[6]}]
set_load -pin_load 0 [get_ports {local_node[1].data_out[5]}]
set_load -pin_load 0 [get_ports {local_node[1].data_out[4]}]
set_load -pin_load 0 [get_ports {local_node[1].data_out[3]}]
set_load -pin_load 0 [get_ports {local_node[1].data_out[2]}]
set_load -pin_load 0 [get_ports {local_node[1].data_out[1]}]
set_load -pin_load 0 [get_ports {local_node[1].data_out[0]}]
set_load -pin_load 0 [get_ports {local_node[2].buffer_full_in}]
set_load -pin_load 0 [get_ports {local_node[2].buffer_full_out}]
set_load -pin_load 0 [get_ports {local_node[2].receiving_data}]
set_load -pin_load 0 [get_ports {local_node[2].sending_data}]
set_load -pin_load 0 [get_ports {local_node[2].data_in[15]}]
set_load -pin_load 0 [get_ports {local_node[2].data_in[14]}]
set_load -pin_load 0 [get_ports {local_node[2].data_in[13]}]
set_load -pin_load 0 [get_ports {local_node[2].data_in[12]}]
set_load -pin_load 0 [get_ports {local_node[2].data_in[11]}]
set_load -pin_load 0 [get_ports {local_node[2].data_in[10]}]
set_load -pin_load 0 [get_ports {local_node[2].data_in[9]}]
set_load -pin_load 0 [get_ports {local_node[2].data_in[8]}]
set_load -pin_load 0 [get_ports {local_node[2].data_in[7]}]
set_load -pin_load 0 [get_ports {local_node[2].data_in[6]}]
set_load -pin_load 0 [get_ports {local_node[2].data_in[5]}]
set_load -pin_load 0 [get_ports {local_node[2].data_in[4]}]
set_load -pin_load 0 [get_ports {local_node[2].data_in[3]}]
set_load -pin_load 0 [get_ports {local_node[2].data_in[2]}]
set_load -pin_load 0 [get_ports {local_node[2].data_in[1]}]
set_load -pin_load 0 [get_ports {local_node[2].data_in[0]}]
set_load -pin_load 0 [get_ports {local_node[2].data_out[15]}]
set_load -pin_load 0 [get_ports {local_node[2].data_out[14]}]
set_load -pin_load 0 [get_ports {local_node[2].data_out[13]}]
set_load -pin_load 0 [get_ports {local_node[2].data_out[12]}]
set_load -pin_load 0 [get_ports {local_node[2].data_out[11]}]
set_load -pin_load 0 [get_ports {local_node[2].data_out[10]}]
set_load -pin_load 0 [get_ports {local_node[2].data_out[9]}]
set_load -pin_load 0 [get_ports {local_node[2].data_out[8]}]
set_load -pin_load 0 [get_ports {local_node[2].data_out[7]}]
set_load -pin_load 0 [get_ports {local_node[2].data_out[6]}]
set_load -pin_load 0 [get_ports {local_node[2].data_out[5]}]
set_load -pin_load 0 [get_ports {local_node[2].data_out[4]}]
set_load -pin_load 0 [get_ports {local_node[2].data_out[3]}]
set_load -pin_load 0 [get_ports {local_node[2].data_out[2]}]
set_load -pin_load 0 [get_ports {local_node[2].data_out[1]}]
set_load -pin_load 0 [get_ports {local_node[2].data_out[0]}]
set_load -pin_load 0 [get_ports {local_node[3].buffer_full_in}]
set_load -pin_load 0 [get_ports {local_node[3].buffer_full_out}]
set_load -pin_load 0 [get_ports {local_node[3].receiving_data}]
set_load -pin_load 0 [get_ports {local_node[3].sending_data}]
set_load -pin_load 0 [get_ports {local_node[3].data_in[15]}]
set_load -pin_load 0 [get_ports {local_node[3].data_in[14]}]
set_load -pin_load 0 [get_ports {local_node[3].data_in[13]}]
set_load -pin_load 0 [get_ports {local_node[3].data_in[12]}]
set_load -pin_load 0 [get_ports {local_node[3].data_in[11]}]
set_load -pin_load 0 [get_ports {local_node[3].data_in[10]}]
set_load -pin_load 0 [get_ports {local_node[3].data_in[9]}]
set_load -pin_load 0 [get_ports {local_node[3].data_in[8]}]
set_load -pin_load 0 [get_ports {local_node[3].data_in[7]}]
set_load -pin_load 0 [get_ports {local_node[3].data_in[6]}]
set_load -pin_load 0 [get_ports {local_node[3].data_in[5]}]
set_load -pin_load 0 [get_ports {local_node[3].data_in[4]}]
set_load -pin_load 0 [get_ports {local_node[3].data_in[3]}]
set_load -pin_load 0 [get_ports {local_node[3].data_in[2]}]
set_load -pin_load 0 [get_ports {local_node[3].data_in[1]}]
set_load -pin_load 0 [get_ports {local_node[3].data_in[0]}]
set_load -pin_load 0 [get_ports {local_node[3].data_out[15]}]
set_load -pin_load 0 [get_ports {local_node[3].data_out[14]}]
set_load -pin_load 0 [get_ports {local_node[3].data_out[13]}]
set_load -pin_load 0 [get_ports {local_node[3].data_out[12]}]
set_load -pin_load 0 [get_ports {local_node[3].data_out[11]}]
set_load -pin_load 0 [get_ports {local_node[3].data_out[10]}]
set_load -pin_load 0 [get_ports {local_node[3].data_out[9]}]
set_load -pin_load 0 [get_ports {local_node[3].data_out[8]}]
set_load -pin_load 0 [get_ports {local_node[3].data_out[7]}]
set_load -pin_load 0 [get_ports {local_node[3].data_out[6]}]
set_load -pin_load 0 [get_ports {local_node[3].data_out[5]}]
set_load -pin_load 0 [get_ports {local_node[3].data_out[4]}]
set_load -pin_load 0 [get_ports {local_node[3].data_out[3]}]
set_load -pin_load 0 [get_ports {local_node[3].data_out[2]}]
set_load -pin_load 0 [get_ports {local_node[3].data_out[1]}]
set_load -pin_load 0 [get_ports {local_node[3].data_out[0]}]
set_load -pin_load 0 [get_ports {local_node[4].buffer_full_in}]
set_load -pin_load 0 [get_ports {local_node[4].buffer_full_out}]
set_load -pin_load 0 [get_ports {local_node[4].receiving_data}]
set_load -pin_load 0 [get_ports {local_node[4].sending_data}]
set_load -pin_load 0 [get_ports {local_node[4].data_in[15]}]
set_load -pin_load 0 [get_ports {local_node[4].data_in[14]}]
set_load -pin_load 0 [get_ports {local_node[4].data_in[13]}]
set_load -pin_load 0 [get_ports {local_node[4].data_in[12]}]
set_load -pin_load 0 [get_ports {local_node[4].data_in[11]}]
set_load -pin_load 0 [get_ports {local_node[4].data_in[10]}]
set_load -pin_load 0 [get_ports {local_node[4].data_in[9]}]
set_load -pin_load 0 [get_ports {local_node[4].data_in[8]}]
set_load -pin_load 0 [get_ports {local_node[4].data_in[7]}]
set_load -pin_load 0 [get_ports {local_node[4].data_in[6]}]
set_load -pin_load 0 [get_ports {local_node[4].data_in[5]}]
set_load -pin_load 0 [get_ports {local_node[4].data_in[4]}]
set_load -pin_load 0 [get_ports {local_node[4].data_in[3]}]
set_load -pin_load 0 [get_ports {local_node[4].data_in[2]}]
set_load -pin_load 0 [get_ports {local_node[4].data_in[1]}]
set_load -pin_load 0 [get_ports {local_node[4].data_in[0]}]
set_load -pin_load 0 [get_ports {local_node[4].data_out[15]}]
set_load -pin_load 0 [get_ports {local_node[4].data_out[14]}]
set_load -pin_load 0 [get_ports {local_node[4].data_out[13]}]
set_load -pin_load 0 [get_ports {local_node[4].data_out[12]}]
set_load -pin_load 0 [get_ports {local_node[4].data_out[11]}]
set_load -pin_load 0 [get_ports {local_node[4].data_out[10]}]
set_load -pin_load 0 [get_ports {local_node[4].data_out[9]}]
set_load -pin_load 0 [get_ports {local_node[4].data_out[8]}]
set_load -pin_load 0 [get_ports {local_node[4].data_out[7]}]
set_load -pin_load 0 [get_ports {local_node[4].data_out[6]}]
set_load -pin_load 0 [get_ports {local_node[4].data_out[5]}]
set_load -pin_load 0 [get_ports {local_node[4].data_out[4]}]
set_load -pin_load 0 [get_ports {local_node[4].data_out[3]}]
set_load -pin_load 0 [get_ports {local_node[4].data_out[2]}]
set_load -pin_load 0 [get_ports {local_node[4].data_out[1]}]
set_load -pin_load 0 [get_ports {local_node[4].data_out[0]}]
set_load -pin_load 0 [get_ports {local_node[5].buffer_full_in}]
set_load -pin_load 0 [get_ports {local_node[5].buffer_full_out}]
set_load -pin_load 0 [get_ports {local_node[5].receiving_data}]
set_load -pin_load 0 [get_ports {local_node[5].sending_data}]
set_load -pin_load 0 [get_ports {local_node[5].data_in[15]}]
set_load -pin_load 0 [get_ports {local_node[5].data_in[14]}]
set_load -pin_load 0 [get_ports {local_node[5].data_in[13]}]
set_load -pin_load 0 [get_ports {local_node[5].data_in[12]}]
set_load -pin_load 0 [get_ports {local_node[5].data_in[11]}]
set_load -pin_load 0 [get_ports {local_node[5].data_in[10]}]
set_load -pin_load 0 [get_ports {local_node[5].data_in[9]}]
set_load -pin_load 0 [get_ports {local_node[5].data_in[8]}]
set_load -pin_load 0 [get_ports {local_node[5].data_in[7]}]
set_load -pin_load 0 [get_ports {local_node[5].data_in[6]}]
set_load -pin_load 0 [get_ports {local_node[5].data_in[5]}]
set_load -pin_load 0 [get_ports {local_node[5].data_in[4]}]
set_load -pin_load 0 [get_ports {local_node[5].data_in[3]}]
set_load -pin_load 0 [get_ports {local_node[5].data_in[2]}]
set_load -pin_load 0 [get_ports {local_node[5].data_in[1]}]
set_load -pin_load 0 [get_ports {local_node[5].data_in[0]}]
set_load -pin_load 0 [get_ports {local_node[5].data_out[15]}]
set_load -pin_load 0 [get_ports {local_node[5].data_out[14]}]
set_load -pin_load 0 [get_ports {local_node[5].data_out[13]}]
set_load -pin_load 0 [get_ports {local_node[5].data_out[12]}]
set_load -pin_load 0 [get_ports {local_node[5].data_out[11]}]
set_load -pin_load 0 [get_ports {local_node[5].data_out[10]}]
set_load -pin_load 0 [get_ports {local_node[5].data_out[9]}]
set_load -pin_load 0 [get_ports {local_node[5].data_out[8]}]
set_load -pin_load 0 [get_ports {local_node[5].data_out[7]}]
set_load -pin_load 0 [get_ports {local_node[5].data_out[6]}]
set_load -pin_load 0 [get_ports {local_node[5].data_out[5]}]
set_load -pin_load 0 [get_ports {local_node[5].data_out[4]}]
set_load -pin_load 0 [get_ports {local_node[5].data_out[3]}]
set_load -pin_load 0 [get_ports {local_node[5].data_out[2]}]
set_load -pin_load 0 [get_ports {local_node[5].data_out[1]}]
set_load -pin_load 0 [get_ports {local_node[5].data_out[0]}]
set_load -pin_load 0 [get_ports {local_node[6].buffer_full_in}]
set_load -pin_load 0 [get_ports {local_node[6].buffer_full_out}]
set_load -pin_load 0 [get_ports {local_node[6].receiving_data}]
set_load -pin_load 0 [get_ports {local_node[6].sending_data}]
set_load -pin_load 0 [get_ports {local_node[6].data_in[15]}]
set_load -pin_load 0 [get_ports {local_node[6].data_in[14]}]
set_load -pin_load 0 [get_ports {local_node[6].data_in[13]}]
set_load -pin_load 0 [get_ports {local_node[6].data_in[12]}]
set_load -pin_load 0 [get_ports {local_node[6].data_in[11]}]
set_load -pin_load 0 [get_ports {local_node[6].data_in[10]}]
set_load -pin_load 0 [get_ports {local_node[6].data_in[9]}]
set_load -pin_load 0 [get_ports {local_node[6].data_in[8]}]
set_load -pin_load 0 [get_ports {local_node[6].data_in[7]}]
set_load -pin_load 0 [get_ports {local_node[6].data_in[6]}]
set_load -pin_load 0 [get_ports {local_node[6].data_in[5]}]
set_load -pin_load 0 [get_ports {local_node[6].data_in[4]}]
set_load -pin_load 0 [get_ports {local_node[6].data_in[3]}]
set_load -pin_load 0 [get_ports {local_node[6].data_in[2]}]
set_load -pin_load 0 [get_ports {local_node[6].data_in[1]}]
set_load -pin_load 0 [get_ports {local_node[6].data_in[0]}]
set_load -pin_load 0 [get_ports {local_node[6].data_out[15]}]
set_load -pin_load 0 [get_ports {local_node[6].data_out[14]}]
set_load -pin_load 0 [get_ports {local_node[6].data_out[13]}]
set_load -pin_load 0 [get_ports {local_node[6].data_out[12]}]
set_load -pin_load 0 [get_ports {local_node[6].data_out[11]}]
set_load -pin_load 0 [get_ports {local_node[6].data_out[10]}]
set_load -pin_load 0 [get_ports {local_node[6].data_out[9]}]
set_load -pin_load 0 [get_ports {local_node[6].data_out[8]}]
set_load -pin_load 0 [get_ports {local_node[6].data_out[7]}]
set_load -pin_load 0 [get_ports {local_node[6].data_out[6]}]
set_load -pin_load 0 [get_ports {local_node[6].data_out[5]}]
set_load -pin_load 0 [get_ports {local_node[6].data_out[4]}]
set_load -pin_load 0 [get_ports {local_node[6].data_out[3]}]
set_load -pin_load 0 [get_ports {local_node[6].data_out[2]}]
set_load -pin_load 0 [get_ports {local_node[6].data_out[1]}]
set_load -pin_load 0 [get_ports {local_node[6].data_out[0]}]
set_load -pin_load 0 [get_ports {local_node[7].buffer_full_in}]
set_load -pin_load 0 [get_ports {local_node[7].buffer_full_out}]
set_load -pin_load 0 [get_ports {local_node[7].receiving_data}]
set_load -pin_load 0 [get_ports {local_node[7].sending_data}]
set_load -pin_load 0 [get_ports {local_node[7].data_in[15]}]
set_load -pin_load 0 [get_ports {local_node[7].data_in[14]}]
set_load -pin_load 0 [get_ports {local_node[7].data_in[13]}]
set_load -pin_load 0 [get_ports {local_node[7].data_in[12]}]
set_load -pin_load 0 [get_ports {local_node[7].data_in[11]}]
set_load -pin_load 0 [get_ports {local_node[7].data_in[10]}]
set_load -pin_load 0 [get_ports {local_node[7].data_in[9]}]
set_load -pin_load 0 [get_ports {local_node[7].data_in[8]}]
set_load -pin_load 0 [get_ports {local_node[7].data_in[7]}]
set_load -pin_load 0 [get_ports {local_node[7].data_in[6]}]
set_load -pin_load 0 [get_ports {local_node[7].data_in[5]}]
set_load -pin_load 0 [get_ports {local_node[7].data_in[4]}]
set_load -pin_load 0 [get_ports {local_node[7].data_in[3]}]
set_load -pin_load 0 [get_ports {local_node[7].data_in[2]}]
set_load -pin_load 0 [get_ports {local_node[7].data_in[1]}]
set_load -pin_load 0 [get_ports {local_node[7].data_in[0]}]
set_load -pin_load 0 [get_ports {local_node[7].data_out[15]}]
set_load -pin_load 0 [get_ports {local_node[7].data_out[14]}]
set_load -pin_load 0 [get_ports {local_node[7].data_out[13]}]
set_load -pin_load 0 [get_ports {local_node[7].data_out[12]}]
set_load -pin_load 0 [get_ports {local_node[7].data_out[11]}]
set_load -pin_load 0 [get_ports {local_node[7].data_out[10]}]
set_load -pin_load 0 [get_ports {local_node[7].data_out[9]}]
set_load -pin_load 0 [get_ports {local_node[7].data_out[8]}]
set_load -pin_load 0 [get_ports {local_node[7].data_out[7]}]
set_load -pin_load 0 [get_ports {local_node[7].data_out[6]}]
set_load -pin_load 0 [get_ports {local_node[7].data_out[5]}]
set_load -pin_load 0 [get_ports {local_node[7].data_out[4]}]
set_load -pin_load 0 [get_ports {local_node[7].data_out[3]}]
set_load -pin_load 0 [get_ports {local_node[7].data_out[2]}]
set_load -pin_load 0 [get_ports {local_node[7].data_out[1]}]
set_load -pin_load 0 [get_ports {local_node[7].data_out[0]}]
set_load -pin_load 0 [get_ports {local_node[8].buffer_full_in}]
set_load -pin_load 0 [get_ports {local_node[8].buffer_full_out}]
set_load -pin_load 0 [get_ports {local_node[8].receiving_data}]
set_load -pin_load 0 [get_ports {local_node[8].sending_data}]
set_load -pin_load 0 [get_ports {local_node[8].data_in[15]}]
set_load -pin_load 0 [get_ports {local_node[8].data_in[14]}]
set_load -pin_load 0 [get_ports {local_node[8].data_in[13]}]
set_load -pin_load 0 [get_ports {local_node[8].data_in[12]}]
set_load -pin_load 0 [get_ports {local_node[8].data_in[11]}]
set_load -pin_load 0 [get_ports {local_node[8].data_in[10]}]
set_load -pin_load 0 [get_ports {local_node[8].data_in[9]}]
set_load -pin_load 0 [get_ports {local_node[8].data_in[8]}]
set_load -pin_load 0 [get_ports {local_node[8].data_in[7]}]
set_load -pin_load 0 [get_ports {local_node[8].data_in[6]}]
set_load -pin_load 0 [get_ports {local_node[8].data_in[5]}]
set_load -pin_load 0 [get_ports {local_node[8].data_in[4]}]
set_load -pin_load 0 [get_ports {local_node[8].data_in[3]}]
set_load -pin_load 0 [get_ports {local_node[8].data_in[2]}]
set_load -pin_load 0 [get_ports {local_node[8].data_in[1]}]
set_load -pin_load 0 [get_ports {local_node[8].data_in[0]}]
set_load -pin_load 0 [get_ports {local_node[8].data_out[15]}]
set_load -pin_load 0 [get_ports {local_node[8].data_out[14]}]
set_load -pin_load 0 [get_ports {local_node[8].data_out[13]}]
set_load -pin_load 0 [get_ports {local_node[8].data_out[12]}]
set_load -pin_load 0 [get_ports {local_node[8].data_out[11]}]
set_load -pin_load 0 [get_ports {local_node[8].data_out[10]}]
set_load -pin_load 0 [get_ports {local_node[8].data_out[9]}]
set_load -pin_load 0 [get_ports {local_node[8].data_out[8]}]
set_load -pin_load 0 [get_ports {local_node[8].data_out[7]}]
set_load -pin_load 0 [get_ports {local_node[8].data_out[6]}]
set_load -pin_load 0 [get_ports {local_node[8].data_out[5]}]
set_load -pin_load 0 [get_ports {local_node[8].data_out[4]}]
set_load -pin_load 0 [get_ports {local_node[8].data_out[3]}]
set_load -pin_load 0 [get_ports {local_node[8].data_out[2]}]
set_load -pin_load 0 [get_ports {local_node[8].data_out[1]}]
set_load -pin_load 0 [get_ports {local_node[8].data_out[0]}]
set_load -pin_load 0 [get_ports {local_node[9].buffer_full_in}]
set_load -pin_load 0 [get_ports {local_node[9].buffer_full_out}]
set_load -pin_load 0 [get_ports {local_node[9].receiving_data}]
set_load -pin_load 0 [get_ports {local_node[9].sending_data}]
set_load -pin_load 0 [get_ports {local_node[9].data_in[15]}]
set_load -pin_load 0 [get_ports {local_node[9].data_in[14]}]
set_load -pin_load 0 [get_ports {local_node[9].data_in[13]}]
set_load -pin_load 0 [get_ports {local_node[9].data_in[12]}]
set_load -pin_load 0 [get_ports {local_node[9].data_in[11]}]
set_load -pin_load 0 [get_ports {local_node[9].data_in[10]}]
set_load -pin_load 0 [get_ports {local_node[9].data_in[9]}]
set_load -pin_load 0 [get_ports {local_node[9].data_in[8]}]
set_load -pin_load 0 [get_ports {local_node[9].data_in[7]}]
set_load -pin_load 0 [get_ports {local_node[9].data_in[6]}]
set_load -pin_load 0 [get_ports {local_node[9].data_in[5]}]
set_load -pin_load 0 [get_ports {local_node[9].data_in[4]}]
set_load -pin_load 0 [get_ports {local_node[9].data_in[3]}]
set_load -pin_load 0 [get_ports {local_node[9].data_in[2]}]
set_load -pin_load 0 [get_ports {local_node[9].data_in[1]}]
set_load -pin_load 0 [get_ports {local_node[9].data_in[0]}]
set_load -pin_load 0 [get_ports {local_node[9].data_out[15]}]
set_load -pin_load 0 [get_ports {local_node[9].data_out[14]}]
set_load -pin_load 0 [get_ports {local_node[9].data_out[13]}]
set_load -pin_load 0 [get_ports {local_node[9].data_out[12]}]
set_load -pin_load 0 [get_ports {local_node[9].data_out[11]}]
set_load -pin_load 0 [get_ports {local_node[9].data_out[10]}]
set_load -pin_load 0 [get_ports {local_node[9].data_out[9]}]
set_load -pin_load 0 [get_ports {local_node[9].data_out[8]}]
set_load -pin_load 0 [get_ports {local_node[9].data_out[7]}]
set_load -pin_load 0 [get_ports {local_node[9].data_out[6]}]
set_load -pin_load 0 [get_ports {local_node[9].data_out[5]}]
set_load -pin_load 0 [get_ports {local_node[9].data_out[4]}]
set_load -pin_load 0 [get_ports {local_node[9].data_out[3]}]
set_load -pin_load 0 [get_ports {local_node[9].data_out[2]}]
set_load -pin_load 0 [get_ports {local_node[9].data_out[1]}]
set_load -pin_load 0 [get_ports {local_node[9].data_out[0]}]
set_load -pin_load 0 [get_ports {local_node[10].buffer_full_in}]
set_load -pin_load 0 [get_ports {local_node[10].buffer_full_out}]
set_load -pin_load 0 [get_ports {local_node[10].receiving_data}]
set_load -pin_load 0 [get_ports {local_node[10].sending_data}]
set_load -pin_load 0 [get_ports {local_node[10].data_in[15]}]
set_load -pin_load 0 [get_ports {local_node[10].data_in[14]}]
set_load -pin_load 0 [get_ports {local_node[10].data_in[13]}]
set_load -pin_load 0 [get_ports {local_node[10].data_in[12]}]
set_load -pin_load 0 [get_ports {local_node[10].data_in[11]}]
set_load -pin_load 0 [get_ports {local_node[10].data_in[10]}]
set_load -pin_load 0 [get_ports {local_node[10].data_in[9]}]
set_load -pin_load 0 [get_ports {local_node[10].data_in[8]}]
set_load -pin_load 0 [get_ports {local_node[10].data_in[7]}]
set_load -pin_load 0 [get_ports {local_node[10].data_in[6]}]
set_load -pin_load 0 [get_ports {local_node[10].data_in[5]}]
set_load -pin_load 0 [get_ports {local_node[10].data_in[4]}]
set_load -pin_load 0 [get_ports {local_node[10].data_in[3]}]
set_load -pin_load 0 [get_ports {local_node[10].data_in[2]}]
set_load -pin_load 0 [get_ports {local_node[10].data_in[1]}]
set_load -pin_load 0 [get_ports {local_node[10].data_in[0]}]
set_load -pin_load 0 [get_ports {local_node[10].data_out[15]}]
set_load -pin_load 0 [get_ports {local_node[10].data_out[14]}]
set_load -pin_load 0 [get_ports {local_node[10].data_out[13]}]
set_load -pin_load 0 [get_ports {local_node[10].data_out[12]}]
set_load -pin_load 0 [get_ports {local_node[10].data_out[11]}]
set_load -pin_load 0 [get_ports {local_node[10].data_out[10]}]
set_load -pin_load 0 [get_ports {local_node[10].data_out[9]}]
set_load -pin_load 0 [get_ports {local_node[10].data_out[8]}]
set_load -pin_load 0 [get_ports {local_node[10].data_out[7]}]
set_load -pin_load 0 [get_ports {local_node[10].data_out[6]}]
set_load -pin_load 0 [get_ports {local_node[10].data_out[5]}]
set_load -pin_load 0 [get_ports {local_node[10].data_out[4]}]
set_load -pin_load 0 [get_ports {local_node[10].data_out[3]}]
set_load -pin_load 0 [get_ports {local_node[10].data_out[2]}]
set_load -pin_load 0 [get_ports {local_node[10].data_out[1]}]
set_load -pin_load 0 [get_ports {local_node[10].data_out[0]}]
set_load -pin_load 0 [get_ports {local_node[11].buffer_full_in}]
set_load -pin_load 0 [get_ports {local_node[11].buffer_full_out}]
set_load -pin_load 0 [get_ports {local_node[11].receiving_data}]
set_load -pin_load 0 [get_ports {local_node[11].sending_data}]
set_load -pin_load 0 [get_ports {local_node[11].data_in[15]}]
set_load -pin_load 0 [get_ports {local_node[11].data_in[14]}]
set_load -pin_load 0 [get_ports {local_node[11].data_in[13]}]
set_load -pin_load 0 [get_ports {local_node[11].data_in[12]}]
set_load -pin_load 0 [get_ports {local_node[11].data_in[11]}]
set_load -pin_load 0 [get_ports {local_node[11].data_in[10]}]
set_load -pin_load 0 [get_ports {local_node[11].data_in[9]}]
set_load -pin_load 0 [get_ports {local_node[11].data_in[8]}]
set_load -pin_load 0 [get_ports {local_node[11].data_in[7]}]
set_load -pin_load 0 [get_ports {local_node[11].data_in[6]}]
set_load -pin_load 0 [get_ports {local_node[11].data_in[5]}]
set_load -pin_load 0 [get_ports {local_node[11].data_in[4]}]
set_load -pin_load 0 [get_ports {local_node[11].data_in[3]}]
set_load -pin_load 0 [get_ports {local_node[11].data_in[2]}]
set_load -pin_load 0 [get_ports {local_node[11].data_in[1]}]
set_load -pin_load 0 [get_ports {local_node[11].data_in[0]}]
set_load -pin_load 0 [get_ports {local_node[11].data_out[15]}]
set_load -pin_load 0 [get_ports {local_node[11].data_out[14]}]
set_load -pin_load 0 [get_ports {local_node[11].data_out[13]}]
set_load -pin_load 0 [get_ports {local_node[11].data_out[12]}]
set_load -pin_load 0 [get_ports {local_node[11].data_out[11]}]
set_load -pin_load 0 [get_ports {local_node[11].data_out[10]}]
set_load -pin_load 0 [get_ports {local_node[11].data_out[9]}]
set_load -pin_load 0 [get_ports {local_node[11].data_out[8]}]
set_load -pin_load 0 [get_ports {local_node[11].data_out[7]}]
set_load -pin_load 0 [get_ports {local_node[11].data_out[6]}]
set_load -pin_load 0 [get_ports {local_node[11].data_out[5]}]
set_load -pin_load 0 [get_ports {local_node[11].data_out[4]}]
set_load -pin_load 0 [get_ports {local_node[11].data_out[3]}]
set_load -pin_load 0 [get_ports {local_node[11].data_out[2]}]
set_load -pin_load 0 [get_ports {local_node[11].data_out[1]}]
set_load -pin_load 0 [get_ports {local_node[11].data_out[0]}]
set_load -pin_load 0 [get_ports {local_node[12].buffer_full_in}]
set_load -pin_load 0 [get_ports {local_node[12].buffer_full_out}]
set_load -pin_load 0 [get_ports {local_node[12].receiving_data}]
set_load -pin_load 0 [get_ports {local_node[12].sending_data}]
set_load -pin_load 0 [get_ports {local_node[12].data_in[15]}]
set_load -pin_load 0 [get_ports {local_node[12].data_in[14]}]
set_load -pin_load 0 [get_ports {local_node[12].data_in[13]}]
set_load -pin_load 0 [get_ports {local_node[12].data_in[12]}]
set_load -pin_load 0 [get_ports {local_node[12].data_in[11]}]
set_load -pin_load 0 [get_ports {local_node[12].data_in[10]}]
set_load -pin_load 0 [get_ports {local_node[12].data_in[9]}]
set_load -pin_load 0 [get_ports {local_node[12].data_in[8]}]
set_load -pin_load 0 [get_ports {local_node[12].data_in[7]}]
set_load -pin_load 0 [get_ports {local_node[12].data_in[6]}]
set_load -pin_load 0 [get_ports {local_node[12].data_in[5]}]
set_load -pin_load 0 [get_ports {local_node[12].data_in[4]}]
set_load -pin_load 0 [get_ports {local_node[12].data_in[3]}]
set_load -pin_load 0 [get_ports {local_node[12].data_in[2]}]
set_load -pin_load 0 [get_ports {local_node[12].data_in[1]}]
set_load -pin_load 0 [get_ports {local_node[12].data_in[0]}]
set_load -pin_load 0 [get_ports {local_node[12].data_out[15]}]
set_load -pin_load 0 [get_ports {local_node[12].data_out[14]}]
set_load -pin_load 0 [get_ports {local_node[12].data_out[13]}]
set_load -pin_load 0 [get_ports {local_node[12].data_out[12]}]
set_load -pin_load 0 [get_ports {local_node[12].data_out[11]}]
set_load -pin_load 0 [get_ports {local_node[12].data_out[10]}]
set_load -pin_load 0 [get_ports {local_node[12].data_out[9]}]
set_load -pin_load 0 [get_ports {local_node[12].data_out[8]}]
set_load -pin_load 0 [get_ports {local_node[12].data_out[7]}]
set_load -pin_load 0 [get_ports {local_node[12].data_out[6]}]
set_load -pin_load 0 [get_ports {local_node[12].data_out[5]}]
set_load -pin_load 0 [get_ports {local_node[12].data_out[4]}]
set_load -pin_load 0 [get_ports {local_node[12].data_out[3]}]
set_load -pin_load 0 [get_ports {local_node[12].data_out[2]}]
set_load -pin_load 0 [get_ports {local_node[12].data_out[1]}]
set_load -pin_load 0 [get_ports {local_node[12].data_out[0]}]
set_load -pin_load 0 [get_ports {local_node[13].buffer_full_in}]
set_load -pin_load 0 [get_ports {local_node[13].buffer_full_out}]
set_load -pin_load 0 [get_ports {local_node[13].receiving_data}]
set_load -pin_load 0 [get_ports {local_node[13].sending_data}]
set_load -pin_load 0 [get_ports {local_node[13].data_in[15]}]
set_load -pin_load 0 [get_ports {local_node[13].data_in[14]}]
set_load -pin_load 0 [get_ports {local_node[13].data_in[13]}]
set_load -pin_load 0 [get_ports {local_node[13].data_in[12]}]
set_load -pin_load 0 [get_ports {local_node[13].data_in[11]}]
set_load -pin_load 0 [get_ports {local_node[13].data_in[10]}]
set_load -pin_load 0 [get_ports {local_node[13].data_in[9]}]
set_load -pin_load 0 [get_ports {local_node[13].data_in[8]}]
set_load -pin_load 0 [get_ports {local_node[13].data_in[7]}]
set_load -pin_load 0 [get_ports {local_node[13].data_in[6]}]
set_load -pin_load 0 [get_ports {local_node[13].data_in[5]}]
set_load -pin_load 0 [get_ports {local_node[13].data_in[4]}]
set_load -pin_load 0 [get_ports {local_node[13].data_in[3]}]
set_load -pin_load 0 [get_ports {local_node[13].data_in[2]}]
set_load -pin_load 0 [get_ports {local_node[13].data_in[1]}]
set_load -pin_load 0 [get_ports {local_node[13].data_in[0]}]
set_load -pin_load 0 [get_ports {local_node[13].data_out[15]}]
set_load -pin_load 0 [get_ports {local_node[13].data_out[14]}]
set_load -pin_load 0 [get_ports {local_node[13].data_out[13]}]
set_load -pin_load 0 [get_ports {local_node[13].data_out[12]}]
set_load -pin_load 0 [get_ports {local_node[13].data_out[11]}]
set_load -pin_load 0 [get_ports {local_node[13].data_out[10]}]
set_load -pin_load 0 [get_ports {local_node[13].data_out[9]}]
set_load -pin_load 0 [get_ports {local_node[13].data_out[8]}]
set_load -pin_load 0 [get_ports {local_node[13].data_out[7]}]
set_load -pin_load 0 [get_ports {local_node[13].data_out[6]}]
set_load -pin_load 0 [get_ports {local_node[13].data_out[5]}]
set_load -pin_load 0 [get_ports {local_node[13].data_out[4]}]
set_load -pin_load 0 [get_ports {local_node[13].data_out[3]}]
set_load -pin_load 0 [get_ports {local_node[13].data_out[2]}]
set_load -pin_load 0 [get_ports {local_node[13].data_out[1]}]
set_load -pin_load 0 [get_ports {local_node[13].data_out[0]}]
set_load -pin_load 0 [get_ports {local_node[14].buffer_full_in}]
set_load -pin_load 0 [get_ports {local_node[14].buffer_full_out}]
set_load -pin_load 0 [get_ports {local_node[14].receiving_data}]
set_load -pin_load 0 [get_ports {local_node[14].sending_data}]
set_load -pin_load 0 [get_ports {local_node[14].data_in[15]}]
set_load -pin_load 0 [get_ports {local_node[14].data_in[14]}]
set_load -pin_load 0 [get_ports {local_node[14].data_in[13]}]
set_load -pin_load 0 [get_ports {local_node[14].data_in[12]}]
set_load -pin_load 0 [get_ports {local_node[14].data_in[11]}]
set_load -pin_load 0 [get_ports {local_node[14].data_in[10]}]
set_load -pin_load 0 [get_ports {local_node[14].data_in[9]}]
set_load -pin_load 0 [get_ports {local_node[14].data_in[8]}]
set_load -pin_load 0 [get_ports {local_node[14].data_in[7]}]
set_load -pin_load 0 [get_ports {local_node[14].data_in[6]}]
set_load -pin_load 0 [get_ports {local_node[14].data_in[5]}]
set_load -pin_load 0 [get_ports {local_node[14].data_in[4]}]
set_load -pin_load 0 [get_ports {local_node[14].data_in[3]}]
set_load -pin_load 0 [get_ports {local_node[14].data_in[2]}]
set_load -pin_load 0 [get_ports {local_node[14].data_in[1]}]
set_load -pin_load 0 [get_ports {local_node[14].data_in[0]}]
set_load -pin_load 0 [get_ports {local_node[14].data_out[15]}]
set_load -pin_load 0 [get_ports {local_node[14].data_out[14]}]
set_load -pin_load 0 [get_ports {local_node[14].data_out[13]}]
set_load -pin_load 0 [get_ports {local_node[14].data_out[12]}]
set_load -pin_load 0 [get_ports {local_node[14].data_out[11]}]
set_load -pin_load 0 [get_ports {local_node[14].data_out[10]}]
set_load -pin_load 0 [get_ports {local_node[14].data_out[9]}]
set_load -pin_load 0 [get_ports {local_node[14].data_out[8]}]
set_load -pin_load 0 [get_ports {local_node[14].data_out[7]}]
set_load -pin_load 0 [get_ports {local_node[14].data_out[6]}]
set_load -pin_load 0 [get_ports {local_node[14].data_out[5]}]
set_load -pin_load 0 [get_ports {local_node[14].data_out[4]}]
set_load -pin_load 0 [get_ports {local_node[14].data_out[3]}]
set_load -pin_load 0 [get_ports {local_node[14].data_out[2]}]
set_load -pin_load 0 [get_ports {local_node[14].data_out[1]}]
set_load -pin_load 0 [get_ports {local_node[14].data_out[0]}]
set_load -pin_load 0 [get_ports {local_node[15].buffer_full_in}]
set_load -pin_load 0 [get_ports {local_node[15].buffer_full_out}]
set_load -pin_load 0 [get_ports {local_node[15].receiving_data}]
set_load -pin_load 0 [get_ports {local_node[15].sending_data}]
set_load -pin_load 0 [get_ports {local_node[15].data_in[15]}]
set_load -pin_load 0 [get_ports {local_node[15].data_in[14]}]
set_load -pin_load 0 [get_ports {local_node[15].data_in[13]}]
set_load -pin_load 0 [get_ports {local_node[15].data_in[12]}]
set_load -pin_load 0 [get_ports {local_node[15].data_in[11]}]
set_load -pin_load 0 [get_ports {local_node[15].data_in[10]}]
set_load -pin_load 0 [get_ports {local_node[15].data_in[9]}]
set_load -pin_load 0 [get_ports {local_node[15].data_in[8]}]
set_load -pin_load 0 [get_ports {local_node[15].data_in[7]}]
set_load -pin_load 0 [get_ports {local_node[15].data_in[6]}]
set_load -pin_load 0 [get_ports {local_node[15].data_in[5]}]
set_load -pin_load 0 [get_ports {local_node[15].data_in[4]}]
set_load -pin_load 0 [get_ports {local_node[15].data_in[3]}]
set_load -pin_load 0 [get_ports {local_node[15].data_in[2]}]
set_load -pin_load 0 [get_ports {local_node[15].data_in[1]}]
set_load -pin_load 0 [get_ports {local_node[15].data_in[0]}]
set_load -pin_load 0 [get_ports {local_node[15].data_out[15]}]
set_load -pin_load 0 [get_ports {local_node[15].data_out[14]}]
set_load -pin_load 0 [get_ports {local_node[15].data_out[13]}]
set_load -pin_load 0 [get_ports {local_node[15].data_out[12]}]
set_load -pin_load 0 [get_ports {local_node[15].data_out[11]}]
set_load -pin_load 0 [get_ports {local_node[15].data_out[10]}]
set_load -pin_load 0 [get_ports {local_node[15].data_out[9]}]
set_load -pin_load 0 [get_ports {local_node[15].data_out[8]}]
set_load -pin_load 0 [get_ports {local_node[15].data_out[7]}]
set_load -pin_load 0 [get_ports {local_node[15].data_out[6]}]
set_load -pin_load 0 [get_ports {local_node[15].data_out[5]}]
set_load -pin_load 0 [get_ports {local_node[15].data_out[4]}]
set_load -pin_load 0 [get_ports {local_node[15].data_out[3]}]
set_load -pin_load 0 [get_ports {local_node[15].data_out[2]}]
set_load -pin_load 0 [get_ports {local_node[15].data_out[1]}]
set_load -pin_load 0 [get_ports {local_node[15].data_out[0]}]
create_clock [get_ports clk.clk]  -period 10  -waveform {0 5}
set_input_delay -clock clk.clk  1  [get_ports clk.clk]
set_input_delay -clock clk.clk  1  [get_ports reset.reset]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].clk}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].buffer_full_in}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].buffer_full_out}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].receiving_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].sending_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].clk}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].buffer_full_in}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].buffer_full_out}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].receiving_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].sending_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].clk}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].buffer_full_in}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].buffer_full_out}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].receiving_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].sending_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].clk}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].buffer_full_in}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].buffer_full_out}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].receiving_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].sending_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].clk}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].buffer_full_in}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].buffer_full_out}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].receiving_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].sending_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].clk}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].buffer_full_in}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].buffer_full_out}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].receiving_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].sending_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].clk}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].buffer_full_in}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].buffer_full_out}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].receiving_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].sending_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].clk}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].buffer_full_in}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].buffer_full_out}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].receiving_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].sending_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].clk}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].buffer_full_in}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].buffer_full_out}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].receiving_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].sending_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].clk}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].buffer_full_in}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].buffer_full_out}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].receiving_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].sending_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].clk}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].buffer_full_in}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].buffer_full_out}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].receiving_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].sending_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].clk}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].buffer_full_in}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].buffer_full_out}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].receiving_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].sending_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].clk}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].buffer_full_in}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].buffer_full_out}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].receiving_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].sending_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].clk}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].buffer_full_in}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].buffer_full_out}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].receiving_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].sending_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].clk}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].buffer_full_in}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].buffer_full_out}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].receiving_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].sending_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].clk}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].buffer_full_in}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].buffer_full_out}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].receiving_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].sending_data}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[0]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[15]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[14]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[13]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[12]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[11]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[10]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[9]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[8]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[7]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[6]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[5]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[4]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[3]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[2]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[1]}]
set_input_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].buffer_full_in}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].buffer_full_out}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].receiving_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].sending_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_in[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[0].data_out[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].buffer_full_in}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].buffer_full_out}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].receiving_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].sending_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_in[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[1].data_out[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].buffer_full_in}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].buffer_full_out}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].receiving_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].sending_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_in[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[2].data_out[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].buffer_full_in}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].buffer_full_out}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].receiving_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].sending_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_in[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[3].data_out[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].buffer_full_in}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].buffer_full_out}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].receiving_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].sending_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_in[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[4].data_out[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].buffer_full_in}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].buffer_full_out}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].receiving_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].sending_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_in[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[5].data_out[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].buffer_full_in}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].buffer_full_out}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].receiving_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].sending_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_in[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[6].data_out[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].buffer_full_in}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].buffer_full_out}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].receiving_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].sending_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_in[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[7].data_out[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].buffer_full_in}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].buffer_full_out}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].receiving_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].sending_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_in[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[8].data_out[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].buffer_full_in}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].buffer_full_out}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].receiving_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].sending_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_in[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[9].data_out[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].buffer_full_in}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].buffer_full_out}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].receiving_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].sending_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_in[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[10].data_out[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].buffer_full_in}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].buffer_full_out}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].receiving_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].sending_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_in[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[11].data_out[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].buffer_full_in}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].buffer_full_out}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].receiving_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].sending_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_in[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[12].data_out[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].buffer_full_in}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].buffer_full_out}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].receiving_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].sending_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_in[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[13].data_out[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].buffer_full_in}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].buffer_full_out}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].receiving_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].sending_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_in[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[14].data_out[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].buffer_full_in}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].buffer_full_out}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].receiving_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].sending_data}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_in[0]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[15]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[14]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[13]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[12]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[11]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[10]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[9]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[8]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[7]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[6]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[5]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[4]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[3]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[2]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[1]}]
set_output_delay -clock clk.clk  1  [get_ports {local_node[15].data_out[0]}]
